In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
   'name':['george','pranjal','mayank','rajjwal','divya'],
   'marks':[99,95,98,96,84],
   'city':['prayahraj','mirzapur','allapur','daraganj','daraganj']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df.head()

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur
2   mayank     98    allapur
3  rajjwal     96   daraganj
4    divya     84   daraganj

In [6]:
df.head(2)

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur

In [7]:
df.to_csv("first.csv")

In [10]:
df.to_csv('second.csv', index = False)

In [11]:
df.tail(2)

      name  marks      city
3  rajjwal     96  daraganj
4    divya     84  daraganj

In [12]:
df.describe()

           marks
count   5.000000
mean   94.400000
std     6.024948
min    84.000000
25%    95.000000
50%    96.000000
75%    98.000000
max    99.000000